In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("Sam.csv")

In [5]:
df

   ID     Name  Score  Salary
0   1    Alice     85   60000
1   2      Bob     78   55000
2   3  Charlie     92   72000
3   4    David     88   68000
4   5     Emma     74   50000
5   6    Frank     90   70000
6   7    Grace     81   62000
7   8    Henry     95   75000
8   9      Ivy     87   67000
9  10     Jack     80   58000

In [6]:
df.to_csv("Ap.csv")

In [7]:
df.to_excel("Ap.xlsx")

In [8]:
df.to_csv("Ap.txt")

In [9]:
df.to_json("op.json")

In [11]:
dfe = pd.read_excel("Ap.xlsx")  # Replace with your actual Excel file path
dfe.to_csv("o.txt")

In [13]:
dfj = pd.read_json("op.json")  # Replace with your actual Excel file path
dfj.to_csv("g.txt")